GopalSaraf/Practicals/PSDL/include/proc/pic16lf15324.inc
// Register: OSCTUNE
#define OSCTUNE OSCTUNE
OSCTUNE                                  equ 0892h
// bitfield definitions
OSCTUNE_HFTUN_POSN                       equ 0000h
OSCTUNE_HFTUN_POSITION                   equ 0000h
OSCTUNE_HFTUN_SIZE                       equ 0006h
OSCTUNE_HFTUN_LENGTH                     equ 0006h
OSCTUNE_HFTUN_MASK                       equ 003Fh
OSCTUNE_HFTUN0_POSN                      equ 0000h
OSCTUNE_HFTUN0_POSITION                  equ 0000h
OSCTUNE_HFTUN0_SIZE                      equ 0001h
OSCTUNE_HFTUN0_LENGTH                    equ 0001h
OSCTUNE_HFTUN0_MASK                      equ 0001h
OSCTUNE_HFTUN1_POSN                      equ 0001h
OSCTUNE_HFTUN1_POSITION                  equ 0001h
OSCTUNE_HFTUN1_SIZE                      equ 0001h
OSCTUNE_HFTUN1_LENGTH                    equ 0001h
OSCTUNE_HFTUN1_MASK                      equ 0002h
OSCTUNE_HFTUN2_POSN                      equ 0002h
OSCTUNE_HFTUN2_POSITION                  equ 0002h
OSCTUNE_HFTUN2_SIZE                      equ 0001h
OSCTUNE_HFTUN2_LENGTH                    equ 0001h
OSCTUNE_HFTUN2_MASK                      equ 0004h
OSCTUNE_HFTUN3_POSN                      equ 0003h
OSCTUNE_HFTUN3_POSITION                  equ 0003h
OSCTUNE_HFTUN3_SIZE                      equ 0001h
OSCTUNE_HFTUN3_LENGTH                    equ 0001h
OSCTUNE_HFTUN3_MASK                      equ 0008h
OSCTUNE_HFTUN4_POSN                      equ 0004h
OSCTUNE_HFTUN4_POSITION                  equ 0004h
OSCTUNE_HFTUN4_SIZE                      equ 0001h
OSCTUNE_HFTUN4_LENGTH                    equ 0001h
OSCTUNE_HFTUN4_MASK                      equ 0010h
OSCTUNE_HFTUN5_POSN                      equ 0005h
OSCTUNE_HFTUN5_POSITION                  equ 0005h
OSCTUNE_HFTUN5_SIZE                      equ 0001h
OSCTUNE_HFTUN5_LENGTH                    equ 0001h
OSCTUNE_HFTUN5_MASK                      equ 0020h

// Register: OSCFRQ
#define OSCFRQ OSCFRQ
OSCFRQ                                   equ 0893h
// bitfield definitions
OSCFRQ_HFFRQ_POSN                        equ 0000h
OSCFRQ_HFFRQ_POSITION                    equ 0000h
OSCFRQ_HFFRQ_SIZE                        equ 0003h
OSCFRQ_HFFRQ_LENGTH                      equ 0003h
OSCFRQ_HFFRQ_MASK                        equ 0007h
OSCFRQ_HFFRQ0_POSN                       equ 0000h
OSCFRQ_HFFRQ0_POSITION                   equ 0000h
OSCFRQ_HFFRQ0_SIZE                       equ 0001h
OSCFRQ_HFFRQ0_LENGTH                     equ 0001h
OSCFRQ_HFFRQ0_MASK                       equ 0001h
OSCFRQ_HFFRQ1_POSN                       equ 0001h
OSCFRQ_HFFRQ1_POSITION                   equ 0001h
OSCFRQ_HFFRQ1_SIZE                       equ 0001h
OSCFRQ_HFFRQ1_LENGTH                     equ 0001h
OSCFRQ_HFFRQ1_MASK                       equ 0002h
OSCFRQ_HFFRQ2_POSN                       equ 0002h
OSCFRQ_HFFRQ2_POSITION                   equ 0002h
OSCFRQ_HFFRQ2_SIZE                       equ 0001h
OSCFRQ_HFFRQ2_LENGTH                     equ 0001h
OSCFRQ_HFFRQ2_MASK                       equ 0004h

// Register: CLKRCON
#define CLKRCON CLKRCON
CLKRCON                                  equ 0895h
// bitfield definitions
CLKRCON_CLKRDIV_POSN                     equ 0000h
CLKRCON_CLKRDIV_POSITION                 equ 0000h
CLKRCON_CLKRDIV_SIZE                     equ 0003h
CLKRCON_CLKRDIV_LENGTH                   equ 0003h
CLKRCON_CLKRDIV_MASK                     equ 0007h
CLKRCON_CLKRDC_POSN                      equ 0003h
CLKRCON_CLKRDC_POSITION                  equ 0003h
CLKRCON_CLKRDC_SIZE                      equ 0002h
CLKRCON_CLKRDC_LENGTH                    equ 0002h
CLKRCON_CLKRDC_MASK                      equ 0018h
CLKRCON_CLKREN_POSN                      equ 0007h
CLKRCON_CLKREN_POSITION                  equ 0007h
CLKRCON_CLKREN_SIZE                      equ 0001h
CLKRCON_CLKREN_LENGTH                    equ 0001h
CLKRCON_CLKREN_MASK                      equ 0080h
CLKRCON_CLKRDIV0_POSN                    equ 0000h
CLKRCON_CLKRDIV0_POSITION                equ 0000h
CLKRCON_CLKRDIV0_SIZE                    equ 0001h
CLKRCON_CLKRDIV0_LENGTH                  equ 0001h
CLKRCON_CLKRDIV0_MASK                    equ 0001h
CLKRCON_CLKRDIV1_POSN                    equ 0001h
CLKRCON_CLKRDIV1_POSITION                equ 0001h
CLKRCON_CLKRDIV1_SIZE                    equ 0001h
CLKRCON_CLKRDIV1_LENGTH                  equ 0001h
CLKRCON_CLKRDIV1_MASK                    equ 0002h
CLKRCON_CLKRDIV2_POSN                    equ 0002h
CLKRCON_CLKRDIV2_POSITION                equ 0002h
CLKRCON_CLKRDIV2_SIZE                    equ 0001h
CLKRCON_CLKRDIV2_LENGTH                  equ 0001h
CLKRCON_CLKRDIV2_MASK                    equ 0004h
CLKRCON_CLKRDC0_POSN                     equ 0003h
CLKRCON_CLKRDC0_POSITION                 equ 0003h
CLKRCON_CLKRDC0_SIZE                     equ 0001h
CLKRCON_CLKRDC0_LENGTH                   equ 0001h
CLKRCON_CLKRDC0_MASK                     equ 0008h
CLKRCON_CLKRDC1_POSN                     equ 0004h
CLKRCON_CLKRDC1_POSITION                 equ 0004h
CLKRCON_CLKRDC1_SIZE                     equ 0001h
CLKRCON_CLKRDC1_LENGTH                   equ 0001h
CLKRCON_CLKRDC1_MASK                     equ 0010h

// Register: CLKRCLK
#define CLKRCLK CLKRCLK
CLKRCLK                                  equ 0896h
// bitfield definitions
CLKRCLK_CLKRCLK_POSN                     equ 0000h
CLKRCLK_CLKRCLK_POSITION                 equ 0000h
CLKRCLK_CLKRCLK_SIZE                     equ 0004h
CLKRCLK_CLKRCLK_LENGTH                   equ 0004h
CLKRCLK_CLKRCLK_MASK                     equ 000Fh
CLKRCLK_CLKRCLK0_POSN                    equ 0000h
CLKRCLK_CLKRCLK0_POSITION                equ 0000h
CLKRCLK_CLKRCLK0_SIZE                    equ 0001h
CLKRCLK_CLKRCLK0_LENGTH                  equ 0001h
CLKRCLK_CLKRCLK0_MASK                    equ 0001h
CLKRCLK_CLKRCLK1_POSN                    equ 0001h
CLKRCLK_CLKRCLK1_POSITION                equ 0001h
CLKRCLK_CLKRCLK1_SIZE                    equ 0001h
CLKRCLK_CLKRCLK1_LENGTH                  equ 0001h
CLKRCLK_CLKRCLK1_MASK                    equ 0002h
CLKRCLK_CLKRCLK2_POSN                    equ 0002h
CLKRCLK_CLKRCLK2_POSITION                equ 0002h
CLKRCLK_CLKRCLK2_SIZE                    equ 0001h
CLKRCLK_CLKRCLK2_LENGTH                  equ 0001h
CLKRCLK_CLKRCLK2_MASK                    equ 0004h
CLKRCLK_CLKRCLK3_POSN                    equ 0003h
CLKRCLK_CLKRCLK3_POSITION                equ 0003h
CLKRCLK_CLKRCLK3_SIZE                    equ 0001h
CLKRCLK_CLKRCLK3_LENGTH                  equ 0001h
CLKRCLK_CLKRCLK3_MASK                    equ 0008h

// Register: FVRCON
#define FVRCON FVRCON
FVRCON                                   equ 090Ch
// bitfield definitions
FVRCON_ADFVR_POSN                        equ 0000h
FVRCON_ADFVR_POSITION                    equ 0000h
FVRCON_ADFVR_SIZE                        equ 0002h
FVRCON_ADFVR_LENGTH                      equ 0002h
FVRCON_ADFVR_MASK                        equ 0003h
FVRCON_CDAFVR_POSN                       equ 0002h
FVRCON_CDAFVR_POSITION                   equ 0002h
FVRCON_CDAFVR_SIZE                       equ 0002h
FVRCON_CDAFVR_LENGTH                     equ 0002h
FVRCON_CDAFVR_MASK                       equ 000Ch
FVRCON_TSRNG_POSN                        equ 0004h
FVRCON_TSRNG_POSITION                    equ 0004h
FVRCON_TSRNG_SIZE                        equ 0001h
FVRCON_TSRNG_LENGTH                      equ 0001h
FVRCON_TSRNG_MASK                        equ 0010h
FVRCON_TSEN_POSN                         equ 0005h
FVRCON_TSEN_POSITION                     equ 0005h
FVRCON_TSEN_SIZE                         equ 0001h
FVRCON_TSEN_LENGTH                       equ 0001h
FVRCON_TSEN_MASK                         equ 0020h
FVRCON_FVRRDY_POSN                       equ 0006h
FVRCON_FVRRDY_POSITION                   equ 0006h
FVRCON_FVRRDY_SIZE                       equ 0001h
FVRCON_FVRRDY_LENGTH                     equ 0001h
FVRCON_FVRRDY_MASK                       equ 0040h
FVRCON_FVREN_POSN                        equ 0007h
FVRCON_FVREN_POSITION                    equ 0007h
FVRCON_FVREN_SIZE                        equ 0001h
FVRCON_FVREN_LENGTH                      equ 0001h
FVRCON_FVREN_MASK                        equ 0080h
FVRCON_ADFVR0_POSN                       equ 0000h
FVRCON_ADFVR0_POSITION                   equ 0000h
FVRCON_ADFVR0_SIZE                       equ 0001h
FVRCON_ADFVR0_LENGTH                     equ 0001h
FVRCON_ADFVR0_MASK                       equ 0001h
FVRCON_ADFVR1_POSN                       equ 0001h
FVRCON_ADFVR1_POSITION                   equ 0001h
FVRCON_ADFVR1_SIZE                       equ 0001h
FVRCON_ADFVR1_LENGTH                     equ 0001h
FVRCON_ADFVR1_MASK                       equ 0002h
FVRCON_CDAFVR0_POSN                      equ 0002h
FVRCON_CDAFVR0_POSITION                  equ 0002h
FVRCON_CDAFVR0_SIZE                      equ 0001h
FVRCON_CDAFVR0_LENGTH                    equ 0001h
FVRCON_CDAFVR0_MASK                      equ 0004h
FVRCON_CDAFVR1_POSN                      equ 0003h
FVRCON_CDAFVR1_POSITION                  equ 0003h
FVRCON_CDAFVR1_SIZE                      equ 0001h
FVRCON_CDAFVR1_LENGTH                    equ 0001h
FVRCON_CDAFVR1_MASK                      equ 0008h

// Register: DAC1CON0
#define DAC1CON0 DAC1CON0
DAC1CON0                                 equ 090Eh
// bitfield definitions
DAC1CON0_NSS_POSN                        equ 0000h
DAC1CON0_NSS_POSITION                    equ 0000h
DAC1CON0_NSS_SIZE                        equ 0001h
DAC1CON0_NSS_LENGTH                      equ 0001h
DAC1CON0_NSS_MASK                        equ 0001h
DAC1CON0_PSS_POSN                        equ 0002h
DAC1CON0_PSS_POSITION                    equ 0002h
DAC1CON0_PSS_SIZE                        equ 0002h
DAC1CON0_PSS_LENGTH                      equ 0002h
DAC1CON0_PSS_MASK                        equ 000Ch
DAC1CON0_OE2_POSN                        equ 0004h
DAC1CON0_OE2_POSITION                    equ 0004h
DAC1CON0_OE2_SIZE                        equ 0001h
DAC1CON0_OE2_LENGTH                      equ 0001h
DAC1CON0_OE2_MASK                        equ 0010h
DAC1CON0_OE1_POSN                        equ 0005h
DAC1CON0_OE1_POSITION                    equ 0005h
DAC1CON0_OE1_SIZE                        equ 0001h
DAC1CON0_OE1_LENGTH                      equ 0001h
DAC1CON0_OE1_MASK                        equ 0020h
DAC1CON0_EN_POSN                         equ 0007h
DAC1CON0_EN_POSITION                     equ 0007h
DAC1CON0_EN_SIZE                         equ 0001h
DAC1CON0_EN_LENGTH                       equ 0001h
DAC1CON0_EN_MASK                         equ 0080h
DAC1CON0_DAC1NSS_POSN                    equ 0000h
DAC1CON0_DAC1NSS_POSITION                equ 0000h
DAC1CON0_DAC1NSS_SIZE                    equ 0001h
DAC1CON0_DAC1NSS_LENGTH                  equ 0001h
DAC1CON0_DAC1NSS_MASK                    equ 0001h
DAC1CON0_DAC1PSS0_POSN                   equ 0002h
DAC1CON0_DAC1PSS0_POSITION               equ 0002h
DAC1CON0_DAC1PSS0_SIZE                   equ 0001h
DAC1CON0_DAC1PSS0_LENGTH                 equ 0001h
DAC1CON0_DAC1PSS0_MASK                   equ 0004h
DAC1CON0_DAC1PSS1_POSN                   equ 0003h
DAC1CON0_DAC1PSS1_POSITION               equ 0003h
DAC1CON0_DAC1PSS1_SIZE                   equ 0001h
DAC1CON0_DAC1PSS1_LENGTH                 equ 0001h
DAC1CON0_DAC1PSS1_MASK                   equ 0008h
DAC1CON0_DAC1OE2_POSN                    equ 0004h
DAC1CON0_DAC1OE2_POSITION                equ 0004h
DAC1CON0_DAC1OE2_SIZE                    equ 0001h
DAC1CON0_DAC1OE2_LENGTH                  equ 0001h
DAC1CON0_DAC1OE2_MASK                    equ 0010h
DAC1CON0_DAC1OE1_POSN                    equ 0005h
DAC1CON0_DAC1OE1_POSITION                equ 0005h
DAC1CON0_DAC1OE1_SIZE                    equ 0001h
DAC1CON0_DAC1OE1_LENGTH                  equ 0001h
DAC1CON0_DAC1OE1_MASK                    equ 0020h
DAC1CON0_DAC1EN_POSN                     equ 0007h
DAC1CON0_DAC1EN_POSITION                 equ 0007h
DAC1CON0_DAC1EN_SIZE                     equ 0001h
DAC1CON0_DAC1EN_LENGTH                   equ 0001h
DAC1CON0_DAC1EN_MASK                     equ 0080h
DAC1CON0_PSS0_POSN                       equ 0002h
DAC1CON0_PSS0_POSITION                   equ 0002h
DAC1CON0_PSS0_SIZE                       equ 0001h
DAC1CON0_PSS0_LENGTH                     equ 0001h
DAC1CON0_PSS0_MASK                       equ 0004h
DAC1CON0_PSS1_POSN                       equ 0003h
DAC1CON0_PSS1_POSITION                   equ 0003h
DAC1CON0_PSS1_SIZE                       equ 0001h
DAC1CON0_PSS1_LENGTH                     equ 0001h
DAC1CON0_PSS1_MASK                       equ 0008h

// Register: DAC1CON1
#define DAC1CON1 DAC1CON1
DAC1CON1                                 equ 090Fh
// bitfield definitions
DAC1CON1_DAC1R_POSN                      equ 0000h
DAC1CON1_DAC1R_POSITION                  equ 0000h
DAC1CON1_DAC1R_SIZE                      equ 0005h
DAC1CON1_DAC1R_LENGTH                    equ 0005h
DAC1CON1_DAC1R_MASK                      equ 001Fh
DAC1CON1_DAC1R0_POSN                     equ 0000h
DAC1CON1_DAC1R0_POSITION                 equ 0000h
DAC1CON1_DAC1R0_SIZE                     equ 0001h
DAC1CON1_DAC1R0_LENGTH                   equ 0001h
DAC1CON1_DAC1R0_MASK                     equ 0001h
DAC1CON1_DAC1R1_POSN                     equ 0001h
DAC1CON1_DAC1R1_POSITION                 equ 0001h
DAC1CON1_DAC1R1_SIZE                     equ 0001h
DAC1CON1_DAC1R1_LENGTH                   equ 0001h
DAC1CON1_DAC1R1_MASK                     equ 0002h
DAC1CON1_DAC1R2_POSN                     equ 0002h
DAC1CON1_DAC1R2_POSITION                 equ 0002h
DAC1CON1_DAC1R2_SIZE                     equ 0001h
DAC1CON1_DAC1R2_LENGTH                   equ 0001h
DAC1CON1_DAC1R2_MASK                     equ 0004h
DAC1CON1_DAC1R3_POSN                     equ 0003h
DAC1CON1_DAC1R3_POSITION                 equ 0003h
DAC1CON1_DAC1R3_SIZE                     equ 0001h
DAC1CON1_DAC1R3_LENGTH                   equ 0001h
DAC1CON1_DAC1R3_MASK                     equ 0008h
DAC1CON1_DAC1R4_POSN                     equ 0004h
DAC1CON1_DAC1R4_POSITION                 equ 0004h
DAC1CON1_DAC1R4_SIZE                     equ 0001h
DAC1CON1_DAC1R4_LENGTH                   equ 0001h
DAC1CON1_DAC1R4_MASK                     equ 0010h

// Register: ZCDCON
#define ZCDCON ZCDCON
ZCDCON                                   equ 091Fh
// bitfield definitions
ZCDCON_ZCDINTN_POSN                      equ 0000h
ZCDCON_ZCDINTN_POSITION                  equ 0000h
ZCDCON_ZCDINTN_SIZE                      equ 0001h
ZCDCON_ZCDINTN_LENGTH                    equ 0001h
ZCDCON_ZCDINTN_MASK                      equ 0001h
ZCDCON_ZCDINTP_POSN                      equ 0001h
ZCDCON_ZCDINTP_POSITION                  equ 0001h
ZCDCON_ZCDINTP_SIZE                      equ 0001h
ZCDCON_ZCDINTP_LENGTH                    equ 0001h
ZCDCON_ZCDINTP_MASK                      equ 0002h
ZCDCON_ZCDPOL_POSN                       equ 0004h
ZCDCON_ZCDPOL_POSITION                   equ 0004h
ZCDCON_ZCDPOL_SIZE                       equ 0001h
ZCDCON_ZCDPOL_LENGTH                     equ 0001h
ZCDCON_ZCDPOL_MASK                       equ 0010h
ZCDCON_ZCDOUT_POSN                       equ 0005h
ZCDCON_ZCDOUT_POSITION                   equ 0005h
ZCDCON_ZCDOUT_SIZE                       equ 0001h
ZCDCON_ZCDOUT_LENGTH                     equ 0001h
ZCDCON_ZCDOUT_MASK                       equ 0020h
ZCDCON_ZCDSEN_POSN                       equ 0007h
ZCDCON_ZCDSEN_POSITION                   equ 0007h
ZCDCON_ZCDSEN_SIZE                       equ 0001h
ZCDCON_ZCDSEN_LENGTH                     equ 0001h
ZCDCON_ZCDSEN_MASK                       equ 0080h

// Register: CMOUT
#define CMOUT CMOUT
CMOUT                                    equ 098Fh
// bitfield definitions
CMOUT_MC1OUT_POSN                        equ 0000h
CMOUT_MC1OUT_POSITION                    equ 0000h
CMOUT_MC1OUT_SIZE                        equ 0001h
CMOUT_MC1OUT_LENGTH                      equ 0001h
CMOUT_MC1OUT_MASK                        equ 0001h
CMOUT_MC2OUT_POSN                        equ 0001h
CMOUT_MC2OUT_POSITION                    equ 0001h
CMOUT_MC2OUT_SIZE                        equ 0001h
CMOUT_MC2OUT_LENGTH                      equ 0001h
CMOUT_MC2OUT_MASK                        equ 0002h
CMOUT_C1OUT_POSN                         equ 0000h
CMOUT_C1OUT_POSITION                     equ 0000h
CMOUT_C1OUT_SIZE                         equ 0001h
CMOUT_C1OUT_LENGTH                       equ 0001h
CMOUT_C1OUT_MASK                         equ 0001h
CMOUT_C2OUT_POSN                         equ 0001h
CMOUT_C2OUT_POSITION                     equ 0001h
CMOUT_C2OUT_SIZE                         equ 0001h
CMOUT_C2OUT_LENGTH                       equ 0001h
CMOUT_C2OUT_MASK                         equ 0002h

// Register: CM1CON0
#define CM1CON0 CM1CON0
CM1CON0                                  equ 0990h
// bitfield definitions
CM1CON0_SYNC_POSN                        equ 0000h
CM1CON0_SYNC_POSITION                    equ 0000h
CM1CON0_SYNC_SIZE                        equ 0001h
CM1CON0_SYNC_LENGTH                      equ 0001h
CM1CON0_SYNC_MASK                        equ 0001h
CM1CON0_HYS_POSN                         equ 0001h
CM1CON0_HYS_POSITION                     equ 0001h
CM1CON0_HYS_SIZE                         equ 0001h
CM1CON0_HYS_LENGTH                       equ 0001h
CM1CON0_HYS_MASK                         equ 0002h
CM1CON0_POL_POSN                         equ 0004h
CM1CON0_POL_POSITION                     equ 0004h
CM1CON0_POL_SIZE                         equ 0001h
CM1CON0_POL_LENGTH                       equ 0001h
CM1CON0_POL_MASK                         equ 0010h
CM1CON0_OUT_POSN                         equ 0006h
CM1CON0_OUT_POSITION                     equ 0006h
CM1CON0_OUT_SIZE                         equ 0001h
CM1CON0_OUT_LENGTH                       equ 0001h
CM1CON0_OUT_MASK                         equ 0040h
CM1CON0_EN_POSN                          equ 0007h
CM1CON0_EN_POSITION                      equ 0007h
CM1CON0_EN_SIZE                          equ 0001h
CM1CON0_EN_LENGTH                        equ 0001h
CM1CON0_EN_MASK                          equ 0080h
CM1CON0_C1SYNC_POSN                      equ 0000h
CM1CON0_C1SYNC_POSITION                  equ 0000h
CM1CON0_C1SYNC_SIZE                      equ 0001h
CM1CON0_C1SYNC_LENGTH                    equ 0001h
CM1CON0_C1SYNC_MASK                      equ 0001h
CM1CON0_C1HYS_POSN                       equ 0001h
CM1CON0_C1HYS_POSITION                   equ 0001h
CM1CON0_C1HYS_SIZE                       equ 0001h
CM1CON0_C1HYS_LENGTH                     equ 0001h
CM1CON0_C1HYS_MASK                       equ 0002h
CM1CON0_C1POL_POSN                       equ 0004h
CM1CON0_C1POL_POSITION                   equ 0004h
CM1CON0_C1POL_SIZE                       equ 0001h
CM1CON0_C1POL_LENGTH                     equ 0001h
CM1CON0_C1POL_MASK                       equ 0010h
CM1CON0_C1OUT_POSN                       equ 0006h
CM1CON0_C1OUT_POSITION                   equ 0006h
CM1CON0_C1OUT_SIZE                       equ 0001h
CM1CON0_C1OUT_LENGTH                     equ 0001h
CM1CON0_C1OUT_MASK                       equ 0040h
CM1CON0_C1EN_POSN                        equ 0007h
CM1CON0_C1EN_POSITION                    equ 0007h
CM1CON0_C1EN_SIZE                        equ 0001h
CM1CON0_C1EN_LENGTH                      equ 0001h
CM1CON0_C1EN_MASK                        equ 0080h

// Register: CM1CON1
#define CM1CON1 CM1CON1
CM1CON1                                  equ 0991h
// bitfield definitions
CM1CON1_INTN_POSN                        equ 0000h
CM1CON1_INTN_POSITION                    equ 0000h
CM1CON1_INTN_SIZE                        equ 0001h
CM1CON1_INTN_LENGTH                      equ 0001h
CM1CON1_INTN_MASK                        equ 0001h
CM1CON1_INTP_POSN                        equ 0001h
CM1CON1_INTP_POSITION                    equ 0001h
CM1CON1_INTP_SIZE                        equ 0001h
CM1CON1_INTP_LENGTH                      equ 0001h
CM1CON1_INTP_MASK                        equ 0002h
CM1CON1_C1INTN_POSN                      equ 0000h
CM1CON1_C1INTN_POSITION                  equ 0000h
CM1CON1_C1INTN_SIZE                      equ 0001h
CM1CON1_C1INTN_LENGTH                    equ 0001h
CM1CON1_C1INTN_MASK                      equ 0001h
CM1CON1_C1INTP_POSN                      equ 0001h
CM1CON1_C1INTP_POSITION                  equ 0001h
CM1CON1_C1INTP_SIZE                      equ 0001h
CM1CON1_C1INTP_LENGTH                    equ 0001h
CM1CON1_C1INTP_MASK                      equ 0002h

